superscript_map = {
    # Numbers
    '0': '⁰', '1': '¹', '2': '²', '3': '³', '4': '⁴',
    '5': '⁵', '6': '⁶', '7': '⁷', '8': '⁸', '9': '⁹',

    # English lowercase letters
    'a': 'ᵃ', 'b': 'ᵇ', 'c': 'ᶜ', 'd': 'ᵈ', 'e': 'ᵉ',
    'f': 'ᶠ', 'g': 'ᶢ', 'h': 'ʰ', 'i': 'ⁱ', 'j': 'ʲ',
    'k': 'ᵏ', 'l': 'ˡ', 'm': 'ᵐ', 'n': 'ⁿ', 'o': 'ᵒ',
    'p': 'ᵖ', 'q': 'ᑫ', 'r': 'ʳ', 's': 'ˢ', 't': 'ᵗ',
    'u': 'ᵘ', 'v': 'ᵛ', 'w': 'ʷ', 'x': 'ˣ', 'y': 'ʸ',
    'z': 'ᶻ', '𝑢': 'ᵘ', '𝑛': 'ⁿ', '𝑜': 'ᵒ', '𝑟': 'ʳ', '𝑚': 'ᵐ',

    # English uppercase letters
    'A': 'ᴬ', 'B': 'ᴮ', 'C': 'ᶜ', 'D': 'ᴰ', 'E': 'ᴱ',
    'F': 'ᶠ', 'G': 'ᴳ', 'H': 'ᴴ', 'I': 'ᴵ', 'J': 'ᴶ',
    'K': 'ᴷ', 'L': 'ᴸ', 'M': 'ᴹ', 'N': 'ᴺ', 'O': 'ᴼ',
    'P': 'ᴾ', 'Q': 'ᵠ', 'R': 'ᴿ', 'S': 'ˢ', 'T': 'ᵀ',
    'U': 'ᵁ', 'V': 'ⱽ', 'W': 'ᵂ', 'X': 'ˣ', 'Y': 'ʸ',
    'Z': 'ᶻ', '𝐿': 'ᴸ',

    # Polish diacritics (lowercase)
    'ą': 'ᵃ', 'ć': 'ᶜ', 'ę': 'ᵉ', 'ł': 'ˡ', 'ń': 'ⁿ',
    'ó': 'ᵒ', 'ś': 'ˢ', 'ź': 'ᶻ', 'ż': 'ᶻ',

    # Polish diacritics (uppercase)
    'Ą': 'ᴬ', 'Ć': 'ᶜ', 'Ę': 'ᴱ', 'Ł': 'ᴸ', 'Ń': 'ᴺ',
    'Ó': 'ᴼ', 'Ś': 'ˢ', 'Ź': 'ᶻ', 'Ż': 'ᶻ',

    # Special symbols
    '(': '⁽', ')': '⁾', '[': '⁽', ']': '⁾',
    '{': '⁽', '}': '⁾', '<': 'ᐸ', '>': 'ᐳ',
    '+': '⁺', '-': '⁻', '=': '⁼', ':': 'ː',
    '.': '·', ',': 'ˌ', "'": 'ˈ', '/': 'ᐟ',
    '|': 'ˈ', '\\': '⧹', '*': '⁎',
    '`': 'ˋ', '~': 'ᵠ', '′': 'ʹ',

    # # Not exists superscripts
    # '!': '!', "?": "?", "@": "@", "&": '&', "%": "%",
    # '#': '#', '$': '$', '_': ' ', ';': ' ', '^': '^',
    # ''
}

subscript_map = {
    # Numbers
    '0': '₀', '1': '₁', '2': '₂', '3': '₃', '4': '₄',
    '5': '₅', '6': '₆', '7': '₇', '8': '₈', '9': '₉',

    # English lowercase letters
    'a': 'ₐ', 'e': 'ₑ', 'h': 'ₕ', 'i': 'ᵢ', 'j': 'ⱼ',
    'k': 'ₖ', 'l': 'ₗ', 'm': 'ₘ', 'n': 'ₙ', 'o': 'ₒ',
    'p': 'ₚ', 'r': 'ᵣ', 's': 'ₛ', 't': 'ₜ', 'u': 'ᵤ',
    'v': 'ᵥ', 'x': 'ₓ', '𝑖': 'ᵢ',

    # English uppercase letters (most uppercase letters don't have subscript equivalents)
    # For unsupported ones, keep the original letter as it is
    'A': 'ₐ', 'E': 'ₑ', 'H': 'ₕ', 'I': 'ᵢ', 'J': 'ⱼ',
    'K': 'ₖ', 'L': 'ₗ', 'M': 'ₘ', 'N': 'ₙ', 'O': 'ₒ',
    'P': 'ₚ', 'R': 'ᵣ', 'S': 'ₛ', 'T': 'ₜ', 'U': 'ᵤ',
    'V': 'ᵥ', 'X': 'ₓ', '𝐿': 'ₗ',

    # Polish diacritics (lowercase)
    'ą': 'ₐ', 'ę': 'ₑ', 'ł': 'ₗ', 'ń': 'ₙ', 'ó': 'ₒ',
    'ś': 'ₛ', 'ź': 'ₓ', 'ż': 'ₓ',

    # Polish diacritics (uppercase)
    'Ą': 'ₐ', 'Ę': 'ₑ', 'Ł': 'ₗ', 'Ń': 'ₙ', 'Ó': 'ₒ',
    'Ś': 'ₛ', 'Ź': 'ₓ', 'Ż': 'ₓ',

    # Special symbols
    '(': '₍', ')': '₎', '[': '₍', ']': '₎',
    '{': '₍', '}': '₎', '+': '₊', '-': '₋', '–': '₋',
    '=': '₌', ':': 'ₐ', '.': '·', ',': 'ₓ',
    "'": 'ₓ', '/': 'ₓ', '|': 'ₓ', '\\': 'ₓ',
    '*': 'ₓ', '^': 'ₓ', '`': 'ₓ', '~': 'ₓ'
}
